{"data":{"site":{"siteMetadata":{"title":"Midway Driving School – ESL/Nervous Adult and Home School Behind the Wheel Driving Lessons Serving the Twin Cities (Saint Paul, Minneapolis), Duluth and Rochester","author":"Midway Driving School"}},"markdownRemark":{"id":"4b552748-e4cc-5de5-8461-ebbe59000999","excerpt":"1. Make Sure Your Route Is All Planned Out Knowing where you are going helps a lot and makes you more confident in your driving abilities. Just one thing less…","html":"<h2>1. Make Sure Your Route Is All Planned Out</h2>\n<p>Knowing where you are going helps a lot and makes you more confident in your driving abilities. Just one thing less to worry about!</p>\n<h2>2. Take Breaks!</h2>\n<p>No one is perfect and on long trips sometimes the driving conditions call for you to pull off to the shoulder or find a gas station. Take breaks when necessary! Maybe you’re tired, stressed, need to stretch your legs, or just need to get some food. Don’t feel bad doing it. Just compose yourself and then go back on the road when you are ready.</p>\n<h2>3. Remove Distractions</h2>\n<p>The less things vying for your attention the better your driving will be! General rule, keep your eyes on the road!</p>\n<blockquote>\n<p>Eat when your engine is turned off, not while driving.\nDrive with as few passengers as possible.\nPut your phone off to the side. No need for texting while driving!</p>\n</blockquote>\n<h2>4. Give Cars Extra Space</h2>\n<p>If you need to drive a little slower, no problem! Make sure you’re in the far right lane and always give other cars ample space. Giving other cars extra space can give you a more time to make decisions and break.</p>\n<h2>5. Practice Driving with a Trusted Friend</h2>\n<p>Especially for beginning drivers, make sure to only invite a trusted responsible friend into the vehicle. This person can catch mistakes, help navigate and make you feel at ease.</p>\n<p>Midway Driving School strives to make you feel comfortable while driving. <a title=\"Midway Driving School Locations and Hours\" href=\"/locations-and-rates\">You can even schedule an appointment to focus on areas you personally want to work on to be confident on the road</a>. Make and appointment today with MDS!</p>","frontmatter":{"title":"5 Tips for Nervous Adult Drivers and New Drivers","date":"September 06, 2012"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/5-tips-for-nervous-adult-drivers/","previous":{"fields":{"slug":"/mds-welcomes-homeschool-students/"},"frontmatter":{"title":"MDS Welcomes Homeschool Students!","tags":["behind the wheel driving","duluth","free pick-up","homeschool behind the wheel","homeschool drivers","minneapolis","minnesota","nervous adult","nervous adult behind the wheel training","online drivers education","rochester","saint paul","twin cities"]}},"next":{"fields":{"slug":"/share-the-road/"},"frontmatter":{"title":"“Share the Road” – MDOT Campaign to See Pedestrians","tags":["duluth","esl","homeschool","homeschool behind the wheel","mndot","midway driving school","minneapolis","minnesota","nervous adult","nervous adult behind the wheel training","pedestrian","rochester","safe driving tips","safe driving tips","saint paul","share the road"]}}}}