{"data":{"site":{"siteMetadata":{"title":"Midway Driving School – ESL/Nervous Adult and Home School Behind the Wheel Driving Lessons Serving the Twin Cities (Saint Paul, Minneapolis), Duluth and Rochester","author":"Midway Driving School"}},"markdownRemark":{"id":"44105b6f-3047-55e3-9b87-fa9684f434d7","excerpt":"It finally happened. Summer FINALLY showed up in Minnesota. Summer in Minnesota means something different to everyone. For you it might mean outdoor barbeques…","html":"<p>It finally happened. Summer FINALLY showed up in Minnesota.</p>\n<p>Summer in Minnesota means something different to everyone. For you it might mean outdoor barbeques, being eaten alive by mosquitoes, or summer road trips. Well, the bad news is you’re on your own for grilling tips and bug spray. The good news is that the good people at nhtsa.gov have assembled some useful <a title=\"Summer Driving Tips\" target=\"_blank\" href=\"https://www.nhtsa.gov/summer-driving-tips\">Summer Driving Tips</a> to help you make your summer road trip a success!</p>\n<p>Here are some of the key things for you to keep in mind:</p>\n<h2>Before you go</h2>\n<p>Nothing kills a road trip quite like car trouble.</p>\n<p>Road trips should be fun for everyone involved, but keep in mind that you’re really asking a lot out of your car. Make sure it’s ready to handle anything the trip throws at it. Tires, wiper blades, fluid levels, cooling systems, lights and air conditioners are great places to start to prevent any future car-related headaches.</p>\n<p>If you’re not car-savvy, do yourself a favor and get your car checked out by a professional before you leave.</p>\n<h2>Safety First</h2>\n<p>If you followed the first step, your car should be happy and ready to go. Great job! Now, how about all those people inside the car? Yeah, they’re usually pretty important too.</p>\n<p>If you’re traveling with children, make sure you’re fully aware of all the safety precautions that come along with that. For starters, small children should be in car seats, all children 13 and younger should be in the back seat, and EVERYONE, young and old, should be buckled up.</p>\n<p>Make sure you plan your route beforehand and don’t forget to schedule frequent breaks to keep yourself happy and alert, especially when travelling with children. If you’re traveling in a group with other adults, driving in shifts is a great way to reduce the burden of navigating a long road trip on any one person.</p>\n<p>Also, keep in mind that, being summer in Minnesota, it will more than likely be HOT. Make sure you’re prepared to deal with the heat and always be mindful of how quickly vehicles can heat up to dangerous temperatures in hot weather.</p>\n<p>You should plan for a safe and happy trip, but be prepared for the worst case scenario. A roadside emergency kit will be worth its weight in gold should anything go wrong.</p>\n<h2>On the Road</h2>\n<p>Finally, you’re on the open road! Now that your road trip is underway, it’s important to be mindful of your surroundings.</p>\n<p>Don’t forget to share the road. Summers, especially in Minnesota, mean more bicycles, more motorcycles, and more pedestrians. Keep everyone in mind when driving (especially those that may be harder to see).</p>\n<p>As always, practice safe driving habits and stay alert. Don’t drive if you’re too tired. If you’re unsure, take a break. Especially when travelling with children, frequent breaks make the experience more pleasant for everyone.</p>\n<h2>In an Emergency</h2>\n<p>Well, darn. You got a flat tire. Now what?</p>\n<p>On any trip, you’re going to want to make sure you have a cell phone with you in case a call for help is necessary.</p>\n<p>Remember the roadside kit I mentioned earlier? I hope so. That’s going to come in handy now. Make sure to take all the safety precautions when doing any type of roadside repair. If you’re unsure whether or not you can handle a repair yourself, play it safe and call for help.</p>\n<p>With smart planning and preparation, car troubles don’t need to derail your vacation.</p>\n<h2>Most Importantly…</h2>\n<p>While following all the rules of the road and keeping you and your party safe, don’t forget to have FUN on your trip! It is a vacation after all!</p>","frontmatter":{"title":"Summer Road Trip Planning","date":"July 11, 2013"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/summer-road-trip-planning/","previous":{"fields":{"slug":"/what-is-defensive-driving/"},"frontmatter":{"title":"What is Defensive Driving?","tags":["defensive driving","safe driving tips"]}},"next":{"fields":{"slug":"/minnesota-seatbelt-laws-save-lives/"},"frontmatter":{"title":"Minnesota Seatbelt Laws Save Lives","tags":["midway driving school","minnesota","minnesota public radio","mn","mn seat belt law","safe driving","safe driving tips","saving lives","seat belt law","university of minnesota"]}}}}