{"data":{"site":{"siteMetadata":{"title":"Midway Driving School – ESL/Nervous Adult and Home School Behind the Wheel Driving Lessons Serving the Twin Cities (Saint Paul, Minneapolis), Duluth and Rochester","author":"Midway Driving School"}},"markdownRemark":{"id":"baca266b-ca5f-5069-b45a-cb58f53fe5ef","excerpt":"Ah yes, it is the magical time of summer in Minnesota. Time to enjoy the MN State Fair or a last trip to the cabin. Maybe 18 holes of sunrise golf, or an…","html":"<p>Ah yes, it is the magical time of summer in Minnesota. Time to enjoy the MN State Fair or a last trip to the cabin. Maybe 18 holes of sunrise golf, or an evening picnic in your own backyard. However nice the weather is though, it is still construction season.  And this summer, we seem to have more than our fair share of road work.</p>\n<p>Make use of these construction driving tips so you can spend more of your time enjoying the summertime rays and less of the summertime construction blues.</p>\n<h2>Check Google first (before you get into the car!)</h2>\n<p>Whether you’ve driven this route a thousand times before, it is a good idea to check <a href=\"https://www.google.com/maps\" target=\"_blank\">Google Maps</a> to see if  your route is taking longer than usual, or whether or not you need to select a new path to your destination. You can also <a href=\"http://www.dot.state.mn.us/roadwork/current.html\" target=\"_blank\">check MNDOT’s site for road closures</a>.</p>\n<h2>Give yourself extra time.</h2>\n<p>We speed and make poor decisions when we are hurried. Give yourself plenty of time this summer for the commute.</p>\n<h2>Obey construction speed limits.</h2>\n<p>Fines in construction zones are higher than on normal roadways. Err on the side of caution when it comes to speed in construction areas.</p>\n<h2>Minimize distractions.</h2>\n<p>No multitasking on the road! Staying free of distractions helps you stay alert; so turn down the radio, keep your eyes on the road, and your hands on the wheel.</p>\n<h2>Give yourself, and the next car, plenty of space</h2>\n<p>Giving yourself more space between your car and the one in front of you, gives you more time to react to changes in speed.</p>\n<p>More construction driving tips at: <a href=\"http://safety.fhwa.dot.gov/wz/resources/fhwasa03012/\" target=\"_blank\">http://safety.fhwa.dot.gov/wz/resources/fhwasa03012/</a></p>","frontmatter":{"title":"Driving Tips for Construction Season","date":"September 12, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/driving-tips-for-construction-season/","previous":{"fields":{"slug":"/what-is-the-blind-spot-and-how/"},"frontmatter":{"title":"What is “The Blind Spot?” And How Can I Manage It?","tags":["blind spot","car talk","driving","midway driving school","safe driving tips"]}},"next":{"fields":{"slug":"/black-ice-tips-for-driving-safely-on-m/"},"frontmatter":{"title":"Black Ice - Tips for driving safely on Minnesota's icy roads","tags":["black ice","defensive driving","defensive driving","driving tips","minnesota","mndot","nervous adult","nervous adult behind the wheel training","nervous drivers","safe driving","safe driving tips","winter driving"]}}}}