{"data":{"site":{"siteMetadata":{"title":"Midway Driving School – ESL/Nervous Adult and Home School Behind the Wheel Driving Lessons Serving the Twin Cities (Saint Paul, Minneapolis), Duluth and Rochester","author":"Midway Driving School"}},"markdownRemark":{"id":"df6c3368-86d4-56be-a4fb-896a220ef43a","excerpt":"Minnesota winters are long and tough. But Minnesotans are tougher! We still maintain our daily routines of work travel, outdoor activities and socializing. We…","html":"<p>Minnesota winters are long and tough. But Minnesotans are tougher! We still maintain our daily routines of work travel, outdoor activities and socializing. We’re mobile in the winter! However, the bitter cold, heavy snowfall and rapid swings in temperature make driving especially difficult. Here are a number of helpful tips to keep in mind as you venture out onto the roads during the cold and snowy months.</p>\n<h2>Make a Car Safety Kit</h2>\n<p>According to the Minnesota Department of Public Safety hundreds of Minnesotans become stranded on the road during bad winter weather. It is important to be ready for an unexpected delay due to a flat tire, car trouble or impassable conditions. Make sure your car has a dedicated place to store these items: jumper cables, a fleece blanket, a bottle of water, a flashlight, windshield scraper, a length of sturdy rope, a bag of sand, a first aid kit and, if space permits, a small shovel. It can also be helpful to place a few candy bars in your glove compartment, in case you’re really stranded.</p>\n<h2>Take Your Time</h2>\n<p>Plan to give yourself extra time on the road when you’re traveling during the winter. Accidents often occur when drivers are rushing to get to their location and push their driving ability past its limits. Peace of mind is worth those extra fifteen minutes!</p>\n<h2>Don’t Follow Too Closely</h2>\n<p>This is a great rule for every time you’re behind the wheel, but it’s doubly important during the winter. Because road conditions are unpredictable, give yourself an extra buffer between you and the car in front of you. A good rule for freeway driving is “the ten second rule.” When the car in front of you passes a sign, begin counting. If you pass the same sign before you reach the number ten, you’re following too closely.</p>\n<p>No one can guarantee an accident-free winter of driving, but following these tips can go a long way towards improving your chances of having a safe winter on the road.</p>","frontmatter":{"title":"Winter Driving Tips","date":"March 26, 2014"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/winter-driving-tips/","previous":{"fields":{"slug":"/minnesota-seatbelt-laws-save-lives/"},"frontmatter":{"title":"Minnesota Seatbelt Laws Save Lives","tags":["midway driving school","minnesota","minnesota public radio","mn","mn seat belt law","safe driving","safe driving tips","saving lives","seat belt law","university of minnesota"]}},"next":{"fields":{"slug":"/what-is-the-blind-spot-and-how/"},"frontmatter":{"title":"What is “The Blind Spot?” And How Can I Manage It?","tags":["blind spot","car talk","driving","midway driving school","safe driving tips"]}}}}